# Pandas Assignment

In [1]:
import pandas as pd

In [10]:
names=pd.Series(["Lucky","Laxman","mani","Ramu","Raju","Sita","chinna","Happy"])

In [11]:
names

0     Lucky
1    Laxman
2      mani
3      Ramu
4      Raju
5      Sita
6    chinna
7     Happy
dtype: object

In [12]:
subject1=pd.Series([45,56,77,89,76,88,24,34])

In [13]:
subject1

0    45
1    56
2    77
3    89
4    76
5    88
6    24
7    34
dtype: int64

In [14]:
subject2=pd.Series([45,67,56,87,35,56,89,57])

In [15]:
subject2

0    45
1    67
2    56
3    87
4    35
5    56
6    89
7    57
dtype: int64

In [16]:
subject3=pd.Series([45,89,56,36,26,78,47,87])

In [17]:
subject3

0    45
1    89
2    56
3    36
4    26
5    78
6    47
7    87
dtype: int64

# NOW CREATING DATAFRAME

In [18]:
class_list=pd.DataFrame({"student_name":names,
                        "Mathematics":subject1,
                        "Physics":subject2,
                        "Chemistry":subject3})

In [19]:
class_list

  student_name  Mathematics  Physics  Chemistry
0        Lucky           45       45         45
1       Laxman           56       67         89
2         mani           77       56         56
3         Ramu           89       87         36
4         Raju           76       35         26
5         Sita           88       56         78
6       chinna           24       89         47
7        Happy           34       57         87

In [20]:
total=class_list.sum(axis=1)

C:\Users\pedda\AppData\Local\Temp/ipykernel_4592/3616658980.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  total=class_list.sum(axis=1)

In [21]:
total

0    135
1    212
2    189
3    212
4    137
5    222
6    160
7    178
dtype: int64

In [22]:
class_list["student_name"]

0     Lucky
1    Laxman
2      mani
3      Ramu
4      Raju
5      Sita
6    chinna
7     Happy
Name: student_name, dtype: object

In [23]:
class_list.head(2)

  student_name  Mathematics  Physics  Chemistry
0        Lucky           45       45         45
1       Laxman           56       67         89

In [24]:
class_list.tail(3)

  student_name  Mathematics  Physics  Chemistry
5         Sita           88       56         78
6       chinna           24       89         47
7        Happy           34       57         87

# ADDING TOTAL COLUMN TO THE DATAFRAME

In [25]:
class_list["Total"]=total

In [26]:
class_list

  student_name  Mathematics  Physics  Chemistry  Total
0        Lucky           45       45         45    135
1       Laxman           56       67         89    212
2         mani           77       56         56    189
3         Ramu           89       87         36    212
4         Raju           76       35         26    137
5         Sita           88       56         78    222
6       chinna           24       89         47    160
7        Happy           34       57         87    178

# ADDING GRADE COLUMN TO THE DATAFRAME USING THE CONDITIONAL STATEMENTS

In [27]:
import numpy as np

In [28]:
class_list["Grades"]=np.where(class_list["Total"]>100,"A","B")

# viewing the class_list

In [29]:
class_list

  student_name  Mathematics  Physics  Chemistry  Total Grades
0        Lucky           45       45         45    135      A
1       Laxman           56       67         89    212      A
2         mani           77       56         56    189      A
3         Ramu           89       87         36    212      A
4         Raju           76       35         26    137      A
5         Sita           88       56         78    222      A
6       chinna           24       89         47    160      A
7        Happy           34       57         87    178      A

# adding the pass/fail column to the dataframe

In [30]:
class_list["Pass/Fail"]=np.where(class_list["Total"]>100,"P","*")

In [31]:
class_list

  student_name  Mathematics  Physics  Chemistry  Total Grades Pass/Fail
0        Lucky           45       45         45    135      A         P
1       Laxman           56       67         89    212      A         P
2         mani           77       56         56    189      A         P
3         Ramu           89       87         36    212      A         P
4         Raju           76       35         26    137      A         P
5         Sita           88       56         78    222      A         P
6       chinna           24       89         47    160      A         P
7        Happy           34       57         87    178      A         P

# describing and viewing the dataframe

In [32]:
class_list.describe()

       Mathematics    Physics  Chemistry       Total
count     8.000000   8.000000   8.000000    8.000000
mean     61.125000  61.500000  58.000000  180.625000
std      24.993928  18.867962  23.916521   34.159029
min      24.000000  35.000000  26.000000  135.000000
25%      42.250000  53.250000  42.750000  154.250000
50%      66.000000  56.500000  51.500000  183.500000
75%      79.750000  72.000000  80.250000  212.000000
max      89.000000  89.000000  89.000000  222.000000

# saving into the csv

In [33]:
class_list.to_csv("class_mark.csv")

# loading the csv file

In [34]:
class_marks=pd.read_csv("class_mark.csv")

In [35]:
class_marks

,Unnamed: 0,student_name,Mathematics,Physics,Chemistry,Total,Grades,Pass/Fail
0,0,Lucky,45,45,45,135,A,P
1,1,Laxman,56,67,89,212,A,P
2,2,mani,77,56,56,189,A,P
3,3,Ramu,89,87,36,212,A,P
4,4,Raju,76,35,26,137,A,P
5,5,Sita,88,56,78,222,A,P
6,6,chinna,24,89,47,160,A,P
7,7,Happy,34,57,87,178,A,P

In [36]:
class_list.head()

  student_name  Mathematics  Physics  Chemistry  Total Grades Pass/Fail
0        Lucky           45       45         45    135      A         P
1       Laxman           56       67         89    212      A         P
2         mani           77       56         56    189      A         P
3         Ramu           89       87         36    212      A         P
4         Raju           76       35         26    137      A         P

In [37]:
class_list.tail()

  student_name  Mathematics  Physics  Chemistry  Total Grades Pass/Fail
3         Ramu           89       87         36    212      A         P
4         Raju           76       35         26    137      A         P
5         Sita           88       56         78    222      A         P
6       chinna           24       89         47    160      A         P
7        Happy           34       57         87    178      A         P